{
  "_name_or_path": "microsoft/swin-tiny-patch4-window7-224",
  "architectures": [
    "SwinForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "depths": [
    2,
    2,
    6,
    2
  ],
  "drop_path_rate": 0.1,
  "embed_dim": 96,
  "encoder_stride": 32,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Actinic-keratoses",
    "1": "Basal-cell-carcinoma",
    "2": "Benign-keratosis-like-lesions",
    "3": "Dermatofibroma",
    "4": "Melanocytic-nevi",
    "5": "Melanoma",
    "6": "Vascular-lesions"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Actinic-keratoses": 0,
    "Basal-cell-carcinoma": 1,
    "Benign-keratosis-like-lesions": 2,
    "Dermatofibroma": 3,
    "Melanocytic-nevi": 4,
    "Melanoma": 5,
    "Vascular-lesions": 6
  },
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 4.0,
  "model_type": "swin",
  "num_channels": 3,
  "num_heads": [
    3,
    6,
    12,
    24
  ],
  "num_layers": 4,
  "patch_size": 4,
  "path_norm": true,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.20.1",
  "use_absolute_embeddings": false,
  "window_size": 7
}
